Revit 2026 API

# SymbolicCurveArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SymbolicCurveArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
SymbolicCurveArrayIterator()
```
```fsharp
new : unit -> SymbolicCurveArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

SymbolicCurveArrayIterator Class

Autodesk.Revit.DB Namespace